app/controllers/api/v1/businesses_controller.rb

	def index
		if params[:user_id]
			@businesses = Business.where("user_id = #{params[:user_id]}")
---
SELECT "businesses".* FROM "businesses" WHERE (user_id = 1)

	def create
		if (@current_user.role == "OWNER")
			@business = @current_user.businesses.new(business_params)
			if @business.save
---
INSERT INTO "businesses" ("name", "user_id", "created_at", "updated_at", "enable") VALUES (?, ?, ?, ?, ?)  [["name", "Peluqueria1"], ["user_id", 2], ["created_at", "2017-02-11 21:06:11.566134"], ["updated_at", "2017-02-11 21:06:11.566134"], ["enable", "t"]]

	def set_business
		@business = Business.find(params[:id])
---
SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT 1  [["id", 1]]