app/controllers/api/v1/customer_service_days_controller.rb

	def create
		if !CustomerServiceDay::DAYS_OF_THE_WEEK.include? params[:day]
			render json: { error: "incorrect day"}, status: :unprocessable_entity
			return
		end
		@customerServiceDay = @business.customerServiceDays.new(customerServiceDay_params)
		if @customerServiceDay.save
---
INSERT INTO "customer_service_days" ("day", "openingTime", "closingTime", "openingTime2", "closingTime2", "business_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def set_business
		@business = Business.find(params[:business_id])
---
SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT 1  [["id", 1]]