app/controllers/api/v1/services_controller.rb

INSERT INTO "services" ("name", "duration", "status", "business_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "HOLA"], ["duration", 30], ["status", "enabled"], ["business_id", 12], ["created_at", "2017-02-12 20:09:27.209701"], ["updated_at", "2017-02-12 20:09:27.209701"]]
---
	def create
		@service = @business.services.new(service_params)

		if @service.save

SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = ? LIMIT 1  [["id", 12]]
---
	def set_business
		@business = Business.find(params[:business_id])