app/controllers/api/v1/shifts_controller.rb

	def index

		if params[:user_id]
			@shifts = Shift.where("user_id = #{params[:user_id]}")
---
SELECT "shifts".* FROM "shifts" WHERE (service_id = 62)

	def update
		puts "hola: #{@shift}"
		if @shift.update(shift_params)
---
UPDATE "shifts" SET "comment" = ?, "updated_at" = ? WHERE "shifts"."id" = ?  [["comment", "yyyytyty"], ["updated_at", "2017-02-26 22:41:20.723990"], ["id", 1398]]

	def set_shift
		@shift = Shift.find(params[:id])
---
SELECT  "shifts".* FROM "shifts" WHERE "shifts"."id" = ? LIMIT 1  [["id", 1398]]