app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("email", "password_hash", "role", "created_at", "updated_at", "enable") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "tokens" ("user_id", "created_at", "updated_at", "token", "expires_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
	def create
		#params = { auth:{ provider: 'facebook', uid:'12adsashd71' } }

		if params[:password]
			@user = User.new(user_params)
			@user.save!
			@token = @user.tokens.create

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "jjacinto@gamil.com"]]
SELECT  "tokens".* FROM "tokens" WHERE "tokens"."user_id" = ?  ORDER BY "tokens"."id" ASC LIMIT 1  [["user_id", 4]]
INSERT INTO "tokens" ("user_id", "created_at", "updated_at", "token", "expires_at") VALUES (?, ?, ?, ?, ?)
---
def login
	if !request.headers["X-AUTH-TOKEN"].nil?
		authenticate
	else
		@user = User.find_by_email(params[:email])
		if @user.password == params[:password]
			@current_user = @user
			@token = Token.where(user_id: @user.id).first
			if !@token.nil? or !@token.is_valid?
				@user.tokens.create